// ------------------------------------------------------------------------------------------------
// シェーダー（固定カラー）
// ------------------------------------------------------------------------------------------------


// ------------------------------------------------------------------------------------------------
// 頂点シェーダー
export const vs_constant = `
attribute vec3 a_position;
uniform mat4 u_wvp;

void main()
{
	gl_Position = u_wvp * vec4(a_position, 1.0);
}
`;


// ------------------------------------------------------------------------------------------------
// フラグメントシェーダー
export const fs_constant = `
/*precision mediump float;*/
precision highp float;

uniform vec4 u_color;

void main()
{
	gl_FragColor = u_color;
}
`;

